import React from 'react'
import './content.css'
function Content() {
  return (
    <div className='contentMain'>
        <p>       Раздел I.
Общие положения
Статья 1
      1. Республика Казахстан утверждает себя демократическим, светским, правовым и социальным государством, высшими ценностями которого являются человек, его жизнь, права и свободы.

      2. Основополагающими принципами деятельности Республики являются: общественное согласие и политическая стабильность, экономическое развитие на благо всего народа, казахстанский патриотизм, решение наиболее важных вопросов государственной жизни демократическими методами, включая голосование на республиканском референдуме или в Парламенте.

      Сноска. См. постановление Конституционного Совета РК от 21.12.2001 № 18/2.</p>
      <p>
Статья 2
      1. Республика Казахстан является унитарным государством с президентской формой правления.

      2. Суверенитет Республики распространяется на всю ее территорию. Государство обеспечивает целостность, неприкосновенность и неотчуждаемость своей территории.

      3. Административно-территориальное устройство Республики, статус ее столицы определяются законом. Столицей Казахстана является город Нур-Султан.

      3-1. В пределах города Нур-Султана может быть установлен особый правовой режим в финансовой сфере в соответствии с конституционным законом.

      4. Наименования Республика Казахстан и Казахстан равнозначны.

      Сноска. См. постановление Конституционного Совета РК от 23.04.2003 № 4.
      Сноска. Статья 2 с изменениями, внесенными законами РК от 21.05.2007 № 254-III (вводится в действие со дня его официального опубликования); от 10.03.2017 № 51-VI (вводится в действие со дня его первого официального опубликования); от 23.03.2019 № 238-VI (вводится в действие со дня его первого официального опубликования).</p>
      <p>Статья 3
      1. Единственным источником государственной власти является народ.

      2. Народ осуществляет власть непосредственно через республиканский референдум и свободные выборы, а также делегирует осуществление своей власти государственным органам.

      3. Никто не может присваивать власть в Республике Казахстан. Присвоение власти преследуется по закону. Право выступать от имени народа и государства принадлежит Президенту, а также Парламенту Республики в пределах его конституционных полномочий. Правительство Республики и иные государственные органы выступают от имени государства в пределах делегированных им полномочий.

      4. Государственная власть в Республике едина, осуществляется на основе Конституции и законов в соответствии с принципом ее разделения на законодательную, исполнительную и судебную ветви и взаимодействия между собой с использованием системы сдержек и противовесов.

      Сноска. См. постановление Конституционного Совета РК от 12.04.2001 № 1/2.</p>
      <p>
Статья 4
      1. Действующим правом в Республике Казахстан являются нормы Конституции, соответствующих ей законов, иных нормативных правовых актов, международных договорных и иных обязательств Республики, а также нормативных постановлений Конституционного Совета и Верховного Суда Республики.

      Примечание. Пункт 1 Законом РК от 08.06.2022 предусмотрено изложить в новой редакции (вводится в действие с 01.01.2023):
      1. Действующим правом в Республике Казахстан являются нормы Конституции, соответствующих ей законов, иных нормативных правовых актов, международных договорных и иных обязательств Республики, а также нормативных постановлений Конституционного Суда и Верховного Суда Республики.
      Примечание. В соответствии с Законом Республики Казахстан от 08.06.2022г. нормативные постановления Конституционного Совета применяются в части, не противоречащей Конституции, до их пересмотра Конституционным Судом.
      2. Конституция имеет высшую юридическую силу и прямое действие на всей территории Республики.

      3. Международные договоры, ратифицированные Республикой, имеют приоритет перед ее законами. Порядок и условия действия на территории Республики Казахстан международных договоров, участником которых является Казахстан, определяются законодательством Республики.

      4. Все законы, международные договоры, участником которых является Республика, публикуются. Официальное опубликование нормативных правовых актов, касающихся прав, свобод и обязанностей граждан, является обязательным условием их применения.

      Сноска. См. нормативные постановления Конституционного Совета РК от 11.10.2000 № 18/2; от 05.11.2009 № 6.
      Сноска. Статья 4 с изменением, внесенным Законом РК от 10.03.2017 № 51-VI (вводится в действие со дня его первого официального опубликования).</p>


Статья 5
      1. В Республике Казахстан признаются идеологическое и политическое многообразие. Не допускается создание в государственных органах организаций политических партий.

      2. Общественные объединения равны перед законом. Не допускается незаконное вмешательство государства в дела общественных объединений и общественных объединений в дела государства, возложение на общественные объединения функций государственных органов.

      3. Запрещаются создание и деятельность общественных объединений, цели или действия которых направлены на насильственное изменение конституционного строя, нарушение целостности Республики, подрыв безопасности государства, разжигание социальной, расовой, национальной, религиозной, сословной и родовой розни, а также создание не предусмотренных законодательством военизированных формирований.

      4. В Республике не допускается деятельность политических партий и профессиональных союзов других государств, партий на религиозной основе, а также финансирование политических партий и профессиональных союзов иностранными юридическими лицами и гражданами, иностранными государствами и международными организациями.

      5. Деятельность иностранных религиозных объединений на территории Республики, а также назначение иностранными религиозными центрами руководителей религиозных объединений в Республике осуществляются по согласованию с соответствующими государственными органами Республики.

      Сноска. См. постановление Конституционного Совета РК от 07.06.2000 № 4/2.
      Сноска. Статья 5 с изменениями, внесенными Законом РК от 21.05.2007 № 254-III (вводится в действие со дня его официального опубликования).
Статья 6
      1. В Республике Казахстан признаются и равным образом защищаются государственная и частная собственность.

      2. Собственность обязывает, пользование ею должно одновременно служить общественному благу. Субъекты и объекты собственности, объем и пределы осуществления собственниками своих прав, гарантии их защиты определяются законом.

      3. Земля и ее недра, воды, растительный и животный мир, другие природные ресурсы принадлежат народу. От имени народа право собственности осуществляет государство. Земля может находиться также в частной собственности на основаниях, условиях и в пределах, установленных законом.

      Сноска. См. постановления Конституционного Совета РК от 03.11.1999 № 19/2; от 13.04.2000 № 2/2; от 12.04.2001 № 1/2; от 23.04.2003 № 4.
      Сноска. Статья 6 с изменением, внесенным Законом РК от 08.06.2022 (вводится в действие c 08.06.2022).
Статья 7
      1. В Республике Казахстан государственным является казахский язык.

      2. В государственных организациях и органах местного самоуправления наравне с казахским официально употребляется русский язык.

      3. Государство заботится о создании условий для изучения и развития языков народа Казахстана.

Статья 8
      Республика Казахстан уважает принципы и нормы международного права, проводит политику сотрудничества и добрососедских отношений между государствами, их равенства и невмешательства во внутренние дела друг друга, мирного разрешения международных споров, отказывается от применения первой вооруженной силы.

      Сноска. См. постановление Конституционного Совета РК от 12.04.2001 № 1/2.
Статья 9
      Республика Казахстан имеет государственные символы - Флаг, Герб и Гимн. Их описание и порядок официального использования устанавливаются конституционным законом.

      Сноска. В статью 9 внесено изменение на казахском языке, текст на русском языке не изменяется Законом РК от 21.05.2007 № 254-III (вводится в действие со дня его официального опубликования).
Раздел II
Человек и гражданин
Статья 10
      1. Гражданство Республики Казахстан приобретается и прекращается в соответствии с законом, является единым и равным независимо от оснований его приобретения.

      2. Гражданин Республики не может быть лишен гражданства, права изменить свое гражданство, а также не может быть изгнан за пределы Казахстана. Лишение гражданства допускается лишь по решению суда за совершение террористических преступлений, а также за причинение иного тяжкого вреда жизненно важным интересам Республики Казахстан.

      3. За гражданином Республики не признается гражданство другого государства.

      Сноска. См. постановление Конституционного Совета РК от 01.12.2003 № 12.
      Сноска. Статья 10 с изменением, внесенным Законом РК от 10.03.2017 № 51-VI (вводится в действие со дня его первого официального опубликования).
Статья 11
      1. Гражданин Республики Казахстан не может быть выдан иностранному государству, если иное не установлено международными договорами Республики.

      2. Республика гарантирует своим гражданам защиту и покровительство за ее пределами.

Статья 12
      1. В Республике Казахстан признаются и гарантируются права и свободы человека в соответствии с Конституцией.

      2. Права и свободы человека принадлежат каждому от рождения, признаются абсолютными и неотчуждаемыми, определяют содержание и применение законов и иных нормативных правовых актов.

      3. Гражданин Республики в силу самого своего гражданства имеет права и несет обязанности.

      4. Иностранцы и лица без гражданства пользуются в Республике правами и свободами, а также несут обязанности, установленные для граждан, если иное не предусмотрено Конституцией, законами и международными договорами.

      5. Осуществление прав и свобод человека и гражданина не должно нарушать прав и свобод других лиц, посягать на конституционный строй и общественную нравственность.

      Сноска. См. постановления Конституционного Совета РК от 01.12.2003 № 12; от 18.04.2007 № 4.
Статья 13
      1. Каждый имеет право на признание его правосубъектности и вправе защищать свои права и свободы всеми не противоречащими закону способами, включая необходимую оборону.

      2. Каждый имеет право на судебную защиту своих прав и свобод.

      3. Каждый имеет право на получение квалифицированной юридической помощи. В случаях, предусмотренных законом, юридическая помощь оказывается бесплатно.

      Сноска. См. постановления Конституционного Совета РК от 29.03.1999 № 7/2; от 15.02.2002 № 1.
Статья 14
      1. Все равны перед законом и судом.

      2. Никто не может подвергаться какой-либо дискриминации по мотивам происхождения, социального, должностного и имущественного положения, пола, расы, национальности, языка, отношения к религии, убеждений, места жительства или по любым иным обстоятельствам.

      Сноска. См. постановления Конституционного Совета РК от 10.03.1999 № 2/2; от 29.03.1999 № 7/2.
Статья 15
      1. Каждый имеет право на жизнь.

      2. Никто не вправе произвольно лишать человека жизни. Смертная казнь запрещается.

      Сноска. См. постановление Конституционного Совета РК от 30.01.2003 № 10.
     
      Сноска. Статья 15 с изменениями, внесенными законами РК от 21.05.2007 № 254-III (вводится в действие со дня его официального опубликования); от 08.06.2022 (вводится в действие с 08.06.2022).
Статья 16
      1. Каждый имеет право на личную свободу.

      2. Арест и содержание под стражей допускаются только в предусмотренных законом случаях и лишь с санкции суда с предоставлением арестованному права обжалования. Без санкции суда лицо может быть подвергнуто задержанию на срок не более семидесяти двух часов.

      3. Каждый задержанный, арестованный, обвиняемый в совершении преступления имеет право пользоваться помощью адвоката (защитника) с момента, соответственно, задержания, ареста или предъявления обвинения.

      Сноска. См. постановление Конституционного Совета РК от 31.12.2003 № 13.
      Сноска. Статья 16 с изменениями, внесенными Законом РК от 21.05.2007 № 254-III (вводится в действие со дня его официального опубликования).
Статья 17
      1. Достоинство человека неприкосновенно.

      2. Никто не должен подвергаться пыткам, насилию, другому жестокому или унижающему человеческое достоинство обращению или наказанию.

Статья 18
      1. Каждый имеет право на неприкосновенность частной жизни, личную и семейную тайну, защиту своей чести и достоинства.

      2. Каждый имеет право на тайну личных вкладов и сбережений, переписки, телефонных переговоров, почтовых, телеграфных и иных сообщений. Ограничения этого права допускаются только в случаях и в порядке, прямо установленных законом.

      3. Государственные органы, общественные объединения, должностные лица и средства массовой информации обязаны обеспечить каждому гражданину возможность ознакомиться с затрагивающими его права и интересы документами, решениями и источниками информации.

      Сноска. См. нормативное постановление Конституционного Совета РК от 20.08.2009 № 5.
Статья 19
      1. Каждый вправе определять и указывать или не указывать свою национальную, партийную и религиозную принадлежность.

      2. Каждый имеет право на пользование родным языком и культурой, на свободный выбор языка общения, воспитания, обучения и творчества.

Статья 20
      1. Свобода слова и творчества гарантируются. Цензура запрещается.

      2. Каждый имеет право свободно получать и распространять информацию любым, не запрещенным законом способом. Перечень сведений, составляющих государственные секреты Республики Казахстан, определяется законом.

      3. Не допускаются пропаганда или агитация насильственного изменения конституционного строя, нарушения целостности Республики, подрыва безопасности государства, войны, социального, расового, национального, религиозного, сословного и родового превосходства, а также культа жестокости и насилия.

Статья 21
      1. Каждому, кто законно находится на территории Республики Казахстан, принадлежит право свободного передвижения по ее территории и свободного выбора местожительства, кроме случаев, оговоренных законом.

      2. Каждый имеет право выезжать за пределы Республики. Граждане Республики имеют право беспрепятственного возвращения в Республику.

Статья 22
      1. Каждый имеет право на свободу совести.

      2. Осуществление права на свободу совести не должно обуславливать или ограничивать общечеловеческие и гражданские права и обязанности перед государством.

Статья 23
      1. Граждане Республики Казахстан имеют право на свободу объединений. Деятельность общественных объединений регулируется законом.

      2. Председатели и судьи Конституционного Суда, Верховного Суда и иных судов, председатели и члены Центральной избирательной комиссии, Высшей аудиторской палаты Республики, военнослужащие, работники органов национальной безопасности, правоохранительных органов не должны состоять в политических партиях, профессиональных союзах, выступать в поддержку какой-либо политической партии.

      Сноска. См. постановление Конституционного Совета РК от 05.07.2000 № 13/2.
     
      Сноска. Статья 23 с изменением, внесенным Законом РК от 08.06.2022 (вводится в действие с 08.06.2022).
Статья 24
      1. Каждый имеет право на свободу труда, свободный выбор рода деятельности и профессии. Принудительный труд допускается только на основании судебного акта о признании виновным в совершении уголовного или административного правонарушения либо в условиях чрезвычайного или военного положения.

      2. Каждый имеет право на условия труда, отвечающие требованиям безопасности и гигиены, на вознаграждение за труд без какой-либо дискриминации, а также на социальную защиту от безработицы.

      3. Признается право на индивидуальные и коллективные трудовые споры с использованием установленных законом способов их разрешения, включая право на забастовку.

      4. Каждый имеет право на отдых. Работающим по трудовому договору гарантируются установленные законом продолжительность рабочего времени, выходные и праздничные дни, оплачиваемый ежегодный отпуск.

      Сноска. См. постановление Конституционного Совета РК от 10.03.1999 № 2/2.
     
      Сноска. Статья 24 с изменением, внесенным Законом РК от 08.06.2022 (вводится в действие с 08.06.2022).
Статья 25
      1. Жилище неприкосновенно. Не допускается лишение жилища, иначе как по решению суда. Проникновение в жилище, производство его осмотра и обыска допускаются лишь в случаях и в порядке, установленных законом.

      2. В Республике Казахстан создаются условия для обеспечения граждан жильем. Указанным в законе категориям граждан, нуждающимся в жилье, оно предоставляется за доступную плату из государственных жилищных фондов в соответствии с установленными законом нормами.

Статья 26
      1. Граждане Республики Казахстан могут иметь в частной собственности любое законно приобретенное имущество.

      2. Собственность, в том числе право наследования, гарантируется законом.

      3. Никто не может быть лишен своего имущества, иначе как по решению суда. Принудительное отчуждение имущества для государственных нужд в исключительных случаях, предусмотренных законом, может быть произведено при условии равноценного его возмещения.

      4. Каждый имеет право на свободу предпринимательской деятельности, свободное использование своего имущества для любой законной предпринимательской деятельности. Монополистическая деятельность регулируется и ограничивается законом. Недобросовестная конкуренция запрещается.

      Сноска. См. постановления Конституционного Совета РК от 16.06.2000 № 6/2; от 20.12.2000 № 21/2; от 01.07.2005 № 4; 28.05.2007 № 5.
Статья 27
      1. Брак и семья, материнство, отцовство и детство находятся под защитой государства.

      2. Забота о детях и их воспитание являются естественным правом и обязанностью родителей.

      3. Совершеннолетние трудоспособные дети обязаны заботиться о нетрудоспособных родителях.

Статья 28
      1. Гражданину Республики Казахстан гарантируется минимальный размер заработной платы и пенсии, социальное обеспечение по возрасту, в случае болезни, инвалидности, потери кормильца и по иным законным основаниям.

      2. Поощряются добровольное социальное страхование, создание дополнительных форм социального обеспечения и благотворительность.

      Сноска. См. постановление Конституционного Совета РК от 12.03.1999 № 3/2.
Статья 29
      1. Граждане Республики Казахстан имеют право на охрану здоровья.

      2. Граждане Республики вправе получать бесплатно гарантированный объем медицинской помощи, установленный законом.

      3. Получение платной медицинской помощи в государственных и частных лечебных учреждениях, а также у лиц, занимающихся частной медицинской практикой, производится на основаниях и в порядке, установленных законом.

Статья 30
      1. Гражданам гарантируется бесплатное среднее образование в государственных учебных заведениях. Среднее образование обязательно.

      2. Гражданин имеет право на получение на конкурсной основе бесплатного высшего образования в государственном высшем учебном заведении.

      3. Получение платного образования в частных учебных заведениях осуществляется на основаниях и в порядке, установленных законом.

      4. Государство устанавливает общеобязательные стандарты образования. Деятельность любых учебных заведений должна соответствовать этим стандартам.
        
    </div>
  )
}

export default Content